# DollarPerFtSup2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..DollarPerFtSup2 Property
SymbolTypeId Class See Also
---
Symbol $/ft², indicating unit Cost per square foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DollarPerFtSup2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DollarPerFtSup2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DollarPerFtSup2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace